1. На скрине 1 во вложении.
2. Пример тразакицонных операций:
 - оплата заказа в интернет магазине пошагово (списание бонусов, снижение цены, ввод промокода, снижение цены, ввод данных по карте, списание средства, очистка корзины, отправка заказа в оплаченные на сборку - иначе откат до состояния наполненной товарами корзины)
 - заварка чая (нагреть чайник, насыпать заварку, залить кипятком - иначе все заново)
 - формирование каталога товаров по распродаже (собрать распродажные товары, сформировать цены с учетом акций, отсортировать, вывести на печать - иначе заново вернуться к первому шагу, поскольку ассортимент может обновиться)
3. На скринах 3-1 и 3-2 во вложении.